# Задача 1.1.

# Есть строка с перечислением песен

my_favorite_songs = 'Waste a Moment, Stayin\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'
s = my_favorite_songs.split(', ')
print('\n',s[0],s[-1],s[1],s[-2],'\n')
# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.
